//////////////////////////////////////////////////////////////////////
// CommonStructs.h
// -------------------------------------------------------------------
// This include file contains all structs and typedefs used by both 
// the server and the clients.
//
// <thohell@home.se>
//////////////////////////////////////////////////////////////////////
#ifndef __COMMONSTRUCTS_H__
#define __COMMONSTRUCTS_H__

#include <windows.h>
#include "Constants.h"

////////////////////////////////////////////////////////////////////
// Screen Drawing API (v2.00, Abin)
//------------------------------------------------------------------
// Drawing on game screen.
////////////////////////////////////////////////////////////////////
typedef LPVOID HD2BITMAP; // handle to bitmap drawn on screen
typedef BOOL (__cdecl *fnD2TextOut)(LPCSTR lpszText, long x, long y);
typedef BOOL (__cdecl *fnD2DrawText)(LPCSTR lpszText, LPCRECT lpRect, UINT nAlign);
typedef POINT (__cdecl *fnD2MoveTo)(long x, long y);
typedef BOOL (__cdecl *fnD2LineTo)(long x, long y);
typedef BOOL (__cdecl *fnD2Rectangle)(LPCRECT lpRect);
typedef BOOL (__cdecl *fnD2FrameRect)(LPCRECT lpRect);
typedef BOOL (__cdecl *fnD2FillRect)(LPCRECT lpRect);
typedef BYTE (__cdecl *fnD2SetFont)(BYTE iFont);
typedef BYTE (__cdecl *fnD2GetFont)();
typedef BYTE (__cdecl *fnD2SetTextColor)(BYTE iColor);
typedef BYTE (__cdecl *fnD2GetTextColor)();
typedef int (__cdecl *fnD2SetBkMode)(int nBkMode);
typedef int (__cdecl *fnD2GetBkMode)();
typedef SIZE (__cdecl *fnD2GetTextExtent)(LPCSTR lpszText);
typedef BYTE (__cdecl *fnD2SetPenColor)(BYTE iColor);
typedef BYTE (__cdecl *fnD2GetPenColor)();
typedef int (__cdecl *fnD2SetPenWidth)(int nWidth);
typedef int (__cdecl *fnD2GetPenWidth)();
typedef BYTE (__cdecl *fnD2SetBrushColor)(BYTE iColor);
typedef BYTE (__cdecl *fnD2GetBrushColor)();
typedef BYTE (__cdecl *fnD2SetBrushTransparency)(BYTE iTransparency);
typedef BYTE (__cdecl *fnD2GetBrushTransparency)();
typedef POINT (__cdecl *fnD2GetCurrentPosition)();
typedef BOOL (__cdecl *fnD2DrawD2Bitmap)(HD2BITMAP hBitmap, long x, long y, BYTE iMaskColor);

////////////////////////////////////////////////////////////////////
// CGameDC (v2.00, Abin)
//------------------------------------------------------------------
// Will be passed to "OnDraw" functions in client modules. Use members
// of this struct to draw customized stuff on the game screen.
////////////////////////////////////////////////////////////////////
typedef struct tagGameDC 
{
	// Drawing methods
	fnD2TextOut					TextOut;	// Draw simple text
	fnD2DrawText				DrawText;	// Draw aligned text
	fnD2MoveTo					MoveTo;		// Change DC start position
	fnD2LineTo					LineTo;		// Draw line
	fnD2Rectangle				Rectangle;	// Draw a solid rectangle outlined by a frame
	fnD2FrameRect				FrameRect;	// Draw empty frame
	fnD2FillRect				FillRect;	// Draw a solid rectangle	
	fnD2DrawD2Bitmap			DrawD2Bitmap; // Draw a bmp image to the screen

	// Drawing data access
	fnD2GetCurrentPosition		GetCurrentPosition; // Current pen position
	fnD2SetFont					SetFont;	// Set font
	fnD2GetFont					GetFont;	// Get font
	fnD2SetTextColor			SetTextColor; // Set text color
	fnD2GetTextColor			GetTextColor; // Get text color
	fnD2SetBkMode				SetBkMode; // Set text background mode
	fnD2GetBkMode				GetBkMode; // Get text background mode
	fnD2GetTextExtent			GetTextExtent; // Get text drawing size
	fnD2SetPenColor				SetPenColor; // Set pen color
	fnD2GetPenColor				GetPenColor; // Get pen color
	fnD2SetPenWidth				SetPenWidth; // Set pen width
	fnD2GetPenWidth				GetPenWidth; // Get pen width
	fnD2SetBrushColor			SetBrushColor; // Set brush color
	fnD2GetBrushColor			GetBrushColor; // Get brush color
	fnD2SetBrushTransparency	SetBrushTransparency; // Set brush transparency
	fnD2GetBrushTransparency	GetBrushTransparency; // Get brush transparency
	
} GAMEDC, *LPGAMEDC;
typedef const tagGameDC* LPCGAMEDC;
typedef tagGameDC CGameDC; // make the name more MFC GDI'ish :)

//////////////////////////////////////////////////////////////////////
// GAMEUNIT
//--------------------------------------------------------------------
// The basic game unit info.
//////////////////////////////////////////////////////////////////////
typedef struct tagGameUnit
{
	DWORD dwUnitID;					// Unit ID
	DWORD dwUnitType;				// Unit type(player, monster, object, etc)
} GAMEUNIT, *LPGAMEUNIT;
typedef const tagGameUnit* LPCGAMEUNIT;

// Unit enumeration callback definition
typedef BOOL (CALLBACK *fnEnumUnitProc)(LPCGAMEUNIT lpUnit, LPARAM lParam);

// Player enumeration callback definition
typedef BOOL (CALLBACK *fnEnumPlayerProc)(DWORD dwPlayerID, LPCSTR lpszPlayerName, DWORD dwPlayerClass, DWORD dwPvpFlags, BYTE iMapID, LPARAM lParam);

//////////////////////////////////////////////////////////////////////
// PRESETUNIT
//--------------------------------------------------------------------
// Game preset-unit(Caves, Stairs, Dens, Towers, Entrances, Izual,
// Hephasto, Countess Chest, etc...).
//////////////////////////////////////////////////////////////////////
typedef struct tagPresetUnit
{
	DWORD dwID;			// Preset unit ID 
	DWORD dwType;		// Preset unit type, monster, object, room tile, etc
	long x;				// Map position x
	long y;				// Map position y
} PRESETUNIT, *LPPRESETUNIT;
typedef const tagPresetUnit* LPCPRESETUNIT;

//////////////////////////////////////////////////////////////////////
// PresetUnit enumeration callback definition
//////////////////////////////////////////////////////////////////////
typedef BOOL (CALLBACK *fnEnumPresetUnitProc)(LPCPRESETUNIT lpPresetUnit, LPARAM lParam);


//////////////////////////////////////////////////////////////////////
// ITEMPROPERTY
//--------------------------------------------------------------------
// Item properties(mods) data. Thanks to Mousepad for the help.
//////////////////////////////////////////////////////////////////////
typedef struct tagItemProperty
{
    WORD wSubProperty; // Sub property value
    WORD wPropertyID; // Property ID
    int nValue; // Property value
} ITEMPROPERTY, *LPITEMPROPERTY;
typedef const tagItemProperty* LPCITEMPROPERTY;

//////////////////////////////////////////////////////////////////////
// Item Enumeration Callback Function def
//////////////////////////////////////////////////////////////////////
typedef BOOL (CALLBACK *fnEnumItemProc)(DWORD dwItemID, LPCSTR lpszItemCode, WORD x, WORD y, LPARAM lParam); 

//////////////////////////////////////////////////////////////////////
// GAMECOMMANDSTRUCT
// -------------------------------------------------------------------
// Contains info about the game command line.
//////////////////////////////////////////////////////////////////////
#ifndef PRIVATE
#define PRIVATE			__cdecl
#endif

typedef struct gamecommandstruct_t
{
	char*	szName;
	BOOL	(PRIVATE *pFunc)(char** argv, int argc);
	char*	szUsage;

} GAMECOMMANDSTRUCT;

//////////////////////////////////////////////////////////////////////
// FINGERPRINTSTRUCT
// -------------------------------------------------------------------
// Structure used when fingerprinting functions.
//////////////////////////////////////////////////////////////////////
#define MAX_FPS_NAME_LEN		0x40
#define MAX_FPS_MODULENAME_LEN	0x10
#define MAX_FPS_FINGERPRINT_LEN	0x80

typedef struct fingerprintstruct_t
{
	char		Name[MAX_FPS_NAME_LEN];
	char		ModuleName[MAX_FPS_MODULENAME_LEN];
	char		FingerPrint[MAX_FPS_FINGERPRINT_LEN];
	DWORD		Offset;
	DWORD		PatchSize;
	DWORD		AddressFound;

} FINGERPRINTSTRUCT;

//////////////////////////////////////////////////////////////////////
// FINGERPRINTINFO
// -------------------------------------------------------------------
// Contains information about fingerprints.
//////////////////////////////////////////////////////////////////////
typedef struct fingerprintinfo_t
{
	LPSTR		FingerprintName;
	LPSTR		DllName;
	LPSTR		Fingerprint;
	DWORD		PatchSize;
	DWORD		Offset;
	PBYTE		OriginalCode;
	DWORD		MemoryLocation;

} FINGERPRINTINFO;

//////////////////////////////////////////////////////////////////////
// Modified by sting.
// Two stuctures changed
//////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////
// PLAYERINFOSTUCT
// -------------------------------------------------------------------
// Contains info about the current player.
//////////////////////////////////////////////////////////////////////
typedef struct playerinfostruct_t
{
	BYTE		UnitType;		// +0x00
	DWORD		CharacterClass;	// +0x04
	DWORD		unknown1;		// +0x08
	DWORD		PlayerID;		// +0x0c
	DWORD		PlayerLocation;	// +0x10 (defines location somehow in or out of town and maybe other locations (0x05=in town, 0x01=out of town)
	LPCSTR		PlayerName;		// +0x14 pointer to LPSZ player name
	BYTE		Act;			// +0x18
	BYTE		unknown2[0x73];	// +0x19
	WORD		PlayerPositionX;// +0x8c
	WORD		PlayerPositionY;// +0x8e
	
} PLAYERINFOSTRUCT, *PPLAYERINFOSTRUCT;

//////////////////////////////////////////////////////////////////////
// GAMESTRUCT
// -------------------------------------------------------------------
//////////////////////////////////////////////////////////////////////
typedef struct gamestruct_t
{
	char	Unknown1[0x1a];
	char	GameName[0x10];
	char	Unknown2[0x08];
	char	ServerIP[0x10];
	char	Unknown3[0x46];
	char	AccountName[0x10];
	char	Unknown4[0x20];
	char	CharacterName[0x10];
	char	Unknown5[0x08];
	char	RealmName[0x10];
	char	Unknown6[0x147];
	char	RealmName2[0x10];
	char	Unknown7[0x08];
	char	GamePassword[0x10];

} GAMESTRUCT, *PGAMESTRUCT;


//////////////////////////////////////////////////////////////////////
// GAMEINFOSTRUCT
// -------------------------------------------------------------------
//////////////////////////////////////////////////////////////////////
typedef struct thisgamestruct_t
{
	PPLAYERINFOSTRUCT	player;
